#region 기본 정보
/*

RPG 구상


조작 :
WASD(이동) + 마우스(공격) + 숫자(스킬)

마우스(이동 및 공격) + QWER ASDF(스킬)


레벨업 시 얻는 스탯 포인트 + 10


스탯 :
힘, 민첩, 지력, 내구력, 운, 신앙


무기 비율? : 
4 고정 = 2가지 무기 혼용 가능


무기 및 비율 : 
검 : 2, 대검 : 4, 단검 : 1, 활 : 3, 지팡이 : 2, 방패 : 2, 창 : 3


무기 등급 :
일반 -> 고급 -> 희귀 -> 영웅 -> 전설 -> 고대


최대 강화 레벨 :
일반 : +10
고급 : +10
희귀 : +15
영웅 : +15
전설 : +20
고대 : +25


무기 수집처 :
일반, 고급, 희귀 : 일반 몬스터 사냥
고급, 희귀, 영웅 : 네임드 몬스터 사냥
희귀, 영웅, 전설, 고대 : 던전 및 필드 보스 사냥
전설, 고대 : 던전 및 필드 레이드


제작 : 모든 등급 가능


무기 별 필요 스탯 :
검 : 민첩 + 힘
대검 : 힘 + 민첩
단검 : 민첩 + 운 + 힘
활 : 민첩 + 힘 + 운
지팡이 : 지력 + 마력 or 신앙 + 마력
방패 : 내구력 + 힘 + 민첩 or 내구력 + 힘 + 신앙 
창 : 힘 + 민첩


양잡 가능 무기 :
검, 단검, 창, 방패


양잡 무기 :
대검


혼용 가능 무기 :
검 - 단검, 검 - 방패 , 검 - 지팡이
단검 - 활, 단검 - 지팡이, 단검 - 창, 단검 - 방패
지팡이 - 방패


현재 스탯 및 착용중인 무기에 따른 클래스명 변경

1.
검 : 검사
장점 : 육각형 캐릭터 | 단점 : 특출난 딜링, 탱킹이 부족함 작은 육각형

대검 : 버서커
장점 : 높은 공격력 및 슈퍼아머 | 단점 : 묵직한 조작감

단검 : 어쌔신
장점 : 빠른 기동성 및 상태이상 | 단점 : 폭딜 부족 및 약한 방어력 

활 : 레인저
장점 : 원거리 무기를 통한 안정적인 딜링 가능 | 단점 : 근접 회피 능력이 부족한 클래스, 유리 대포

지팡이 : 메이지 / 프리스트
장점 : 압도적인 폭딜 능력 or 파티원 힐링 및 버프 | 단점 : 캐스팅이 느리고 내구력이 약함, 개인의 딜링 능력 부족

방패 : 팔라딘
장점 : 내구력을 바탕으로 생존력이 높음 | 단점 : 개인의 딜링 능력 부족으로 솔플시 클리어타임이 오래걸림

창 : 랜서
장점 : 순간 순간 폭딜 능력이 강함, 단일개체한테 강한 편 | 단점 : 콤보 스킬로 인한 숙련도가 필요


2. 복합 무기 혼용 (하이브리드 클래스)
[검 조합]
검 + 검 : 블레이드 댄서
장점 : 강력한 데미지와 콤보 | 단점 : 기존 검 하나만 장착했을때에 비해 부족한 유틸 + 콤보 난이도

단검 + 단검 : 듀얼 블레이드
장점 : 빠른 기동력을 이용한 약점 딜링, 콤보 | 단점 : 유리 대포

검 + 단검 : 시프 나이트
장점 : 검의 안정성과 단검의 치명타 위주의 플레이 | 단점 : 주스탯이 3가지를 골고루 올려야함

검 + 방패 : 나이트
장점 : 공방의 밸런스가 잘 잡혀있음 | 단점 : 딜링 포텐셜이 퓨어딜러보다 낮음

검 + 지팡이 : 마검사
장점 : 어떠한 상황이든 유연한 대처가능 | 단점 : 높은 이해도가 필요, 조작 난이도 높음

   
[단검 조합] 
단검 + 활 : 스커미셔
장점 : 원거리 견제와 근거리 대처 모두 뛰어남 | 단점 : 높은 이해도가 필요, 조작 난이도 높음

단검 + 창 : 템페스트
장점 : 창의 단일 공격력과 단검의 기동성을 살린 플레이 | 단점 : 방어 기술의 부제와 낮은 방어력


[지팡이 조합]
지팡이 + 방패 : 템플러 / 세이지
장점 : 본인을 스스로 지키며 안정적인 딜링 및 힐링 가능 | 단점 : 단일 클래스에 비해 낮은 딜링 및 힐링
*/
#endregion

#region 검사 스킬
/*

*/
#endregion

#region 버서커 스킬
/*

*/
#endregion

#region 어쌔신 스킬
/*

*/
#endregion

#region 레인저 스킬
/*

*/
#endregion

#region 메이지 스킬
/*

*/
#endregion

#region 프리스트 스킬
/*

*/
#endregion

#region 팔라딘 스킬
/*

*/
#endregion

#region 랜서 스킬
/*

*/
#endregion

#region 블레이드 댄서 스킬
/*

*/
#endregion

#region 듀얼 블레이드 스킬
/*

*/
#endregion

#region 시프 나이트 스킬
/*

*/
#endregion

#region 나이트 스킬
/*

*/
#endregion

#region 마검사 스킬
/*

*/
#endregion

#region 스커미셔 스킬
/*

*/
#endregion

#region 템페스트 스킬
/*

*/
#endregion

#region 템플러 스킬
/*

*/
#endregion

#region 세이지 스킬
/*

*/
#endregion

#region 대장장이
/*

특수 클래스 : 대장장이

레이드 참여 불가 클래스

필드 사냥 또는 퀘스트, [레이드 보상] 거래를 통해 얻은 대장장이 전용 재화로
유저의 무기 강화확률 소폭증가 또는 무기 제작시 붙는 추가 옵션 상승


장점 :
서버 내 최고의 경제적·사회적 권력
유저간에 상호작용 상승
안전하고 독립적인 성장

★★★
단점 :
전투 및 솔로 플레이의 한계
인간관계 스트레스(갑질)
장사꾼
*/
#endregion